Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core1.xml
        <register>
          <name>MAINPLL0PFD</name>
          <description>Main PLL0 PFD</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80808080</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PFD0</name>
              <description>PLL Fractional Divider 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PFD0_CLKRDY</name>
              <description>PFD0 Clock Ready</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTREADY</name>
                  <description>PFD0 clock is not ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>PFD0 clock is ready.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFD0_CLKGATE</name>
              <description>PFD0 Clock Gate</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTGATED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GATED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFD1</name>
              <description>PLL Fractional Divider 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PFD1_CLKRDY</name>
              <description>PFD1 Clock Ready</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTREADY</name>
                  <description>PFD1 clock is not ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>PFD1 clock is ready.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFD1_CLKGATE</name>
              <description>PFD1 Clock Gate</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTGATED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GATED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFD2</name>
              <description>PLL Fractional Divider 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PFD2_CLKRDY</name>
              <description>PFD2 Clock Ready</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTREADY</name>
                  <description>PFD2 clock is not ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>PFD2 clock is ready.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFD2_CLKGATE</name>
              <description>PFD2 Clock Gate</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTGATED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GATED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFD3</name>
              <description>PLL Fractional Divider 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PFD3_CLKRDY</name>
              <description>PFD3 Clock Ready</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTREADY</name>
                  <description>PFD3 clock is not ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>PFD3 clock is ready.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFD3_CLKGATE</name>
              <description>PFD3 Clock Gate</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTGATED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GATED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
