Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core1.xml
        <register>
          <name>STAT</name>
          <description>MICFIL Status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0F</name>
              <description>Channel 0 Output Data Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wm_notreached</name>
                  <description>Not surpassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wm_reached</name>
                  <description>Surpassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1F</name>
              <description>Channel 1 Output Data Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wm_notreached</name>
                  <description>Not surpassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wm_reached</name>
                  <description>Surpassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH2F</name>
              <description>Channel 2 Output Data Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wm_notreached</name>
                  <description>Not surpassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wm_reached</name>
                  <description>Surpassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3F</name>
              <description>Channel 3 Output Data Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wm_notreached</name>
                  <description>Not surpassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wm_reached</name>
                  <description>Surpassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH4F</name>
              <description>Channel 4 Output Data Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wm_notreached</name>
                  <description>Not surpassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wm_reached</name>
                  <description>Surpassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH5F</name>
              <description>Channel 5 Output Data Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wm_notreached</name>
                  <description>Not surpassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wm_reached</name>
                  <description>Surpassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH6F</name>
              <description>Channel 6 Output Data Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wm_notreached</name>
                  <description>Not surpassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wm_reached</name>
                  <description>Surpassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH7F</name>
              <description>Channel 7 Output Data Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wm_notreached</name>
                  <description>Not surpassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wm_reached</name>
                  <description>Surpassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSY_FIL</name>
              <description>Busy Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>stopped</name>
                  <description>MICFIL is stopped</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>running</name>
                  <description>MICFIL is running</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO_CTRL</name>
          <description>MICFIL FIFO Control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIFOWMK</name>
              <description>FIFO Watermark Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO_STAT</name>
          <description>MICFIL FIFO Status</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>FIFOOVF0</name>
              <description>FIFO Overflow Exception Flag for Channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF1</name>
              <description>FIFO Overflow Exception Flag for Channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF2</name>
              <description>FIFO Overflow Exception Flag for Channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF3</name>
              <description>FIFO Overflow Exception Flag for Channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF4</name>
              <description>FIFO Overflow Exception Flag for Channel 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF5</name>
              <description>FIFO Overflow Exception Flag for Channel 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF6</name>
              <description>FIFO Overflow Exception Flag for Channel 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF7</name>
              <description>FIFO Overflow Exception Flag for Channel 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND0</name>
              <description>FIFO Underflow Exception Flag for Channel 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND1</name>
              <description>FIFO Underflow Exception Flag for Channel 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND2</name>
              <description>FIFO Underflow Exception Flag for Channel 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND3</name>
              <description>FIFO Underflow Exception Flag for Channel 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND4</name>
              <description>FIFO Underflow Exception Flag for Channel 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND5</name>
              <description>FIFO Underflow Exception Flag for Channel 5</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND6</name>
              <description>FIFO Underflow Exception Flag for Channel 6</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND7</name>
              <description>FIFO Underflow Exception Flag for Channel 7</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DATACH[%s]</name>
          <description>MICFIL Output Result</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Channel n Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
