Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core1.xml
        <register>
          <name>PDRUNCFG3</name>
          <description>PD Run Configuration 3 in Sense Domain</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM0</name>
              <description>Power Down RAM Partition 0 Periphery</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 0 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM1</name>
              <description>Power Down RAM Partition 1 Periphery</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 1 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2</name>
              <description>Power Down RAM Partition 2 Periphery</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 2 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM3</name>
              <description>Power Down RAM Partition 3 Periphery</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 3 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM4</name>
              <description>Power Down RAM Partition 4 Periphery</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 4 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM5</name>
              <description>Power Down RAM Partition 5 Periphery</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 5 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM6</name>
              <description>Power Down RAM Partition 6 Periphery</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 6 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM7</name>
              <description>Power Down RAM Partition 7 Periphery</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 7 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM8</name>
              <description>Power Down RAM Partition 8 Periphery</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 8 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM9</name>
              <description>Power Down RAM Partition 9 Periphery</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 9 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM10</name>
              <description>Power Down RAM Partition 10 Periphery</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 10 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM11</name>
              <description>Power Down RAM Partition 11 Periphery</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 11 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM12</name>
              <description>Power Down RAM Partition 12 Periphery</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 12 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM13</name>
              <description>Power Down RAM Partition 13 Periphery</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 13 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM14</name>
              <description>Power Down RAM Partition 14 Periphery</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 14 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM15</name>
              <description>Power Down RAM Partition 15 Periphery</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 15 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM16</name>
              <description>Power Down RAM Partition 16 Periphery</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 16 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM17</name>
              <description>Power Down RAM Partition 17 Periphery</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 17 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM18</name>
              <description>Power Down RAM Partition 18 Periphery</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 18 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM19</name>
              <description>Power Down RAM Partition 19 Periphery</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 19 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM20</name>
              <description>Power Down RAM Partition 20 Periphery</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 20 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM21</name>
              <description>Power Down RAM Partition 21 Periphery</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 21 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM22</name>
              <description>Power Down RAM Partition 22 Periphery</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 22 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM23</name>
              <description>Power Down RAM Partition 23 Periphery</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 23 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM24</name>
              <description>Power Down RAM Partition 24 Periphery</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 24 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM25</name>
              <description>Power Down RAM Partition 25 Periphery</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 25 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM26</name>
              <description>Power Down RAM Partition 26 Periphery</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 26 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM27</name>
              <description>Power Down RAM Partition 27 Periphery</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 27 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM28</name>
              <description>Power Down RAM Partition 28 Periphery</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 28 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM29</name>
              <description>Power Down RAM Partition 29 Periphery</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on when the corresponding array SRAM 29 is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
