Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core1.xml
        <register>
          <name>PDSLEEPCFG2</name>
          <description>PD Sleep Configuration 2 in Sense Domain</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM0</name>
              <description>RAM Partition 0 Array Power Down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 0 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 0 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM1</name>
              <description>RAM Partition 1 Array Power Down</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 1 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 1 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2</name>
              <description>RAM Partition 2 Array Power Down</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 2 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 2 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM3</name>
              <description>RAM Partition 3 Array Power Down</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 3 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 3 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM4</name>
              <description>RAM Partition 4 Array Power Down</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 4 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 4 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM5</name>
              <description>RAM Partition 5 Array Power Down</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 5 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 5 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM6</name>
              <description>RAM Partition 6 Array Power Down</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 6 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 6 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM7</name>
              <description>RAM Partition 7 Array Power Down</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 7 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 7 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM8</name>
              <description>RAM Partition 8 Array Power Down</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 8 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 8 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM9</name>
              <description>RAM Partition 9 Array Power Down</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 9 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 9 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM10</name>
              <description>RAM Partition 10 Array Power Down</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 10 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 10 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM11</name>
              <description>RAM Partition 11 Array Power Down</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 11 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 11 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM12</name>
              <description>RAM Partition 12 Array Power Down</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 12 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 12 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM13</name>
              <description>RAM Partition 13 Array Power Down</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 13 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 13 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM14</name>
              <description>RAM Partition 14 Array Power Down</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 14 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 14 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM15</name>
              <description>RAM Partition 15 Array Power Down</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 15 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 15 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM16</name>
              <description>RAM Partition 16 Array Power Down</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 16 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 16 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM17</name>
              <description>RAM Partition 17 Array Power Down</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 17 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 17 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM18</name>
              <description>RAM Partition 18 Array Power Down</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 18 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 18 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM19</name>
              <description>RAM Partition 19 Array Power Down</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 19 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 19 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM20</name>
              <description>RAM Partition 20 Array Power Down</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 20 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 20 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM21</name>
              <description>RAM Partition 21 Array Power Down</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 21 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 21 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM22</name>
              <description>RAM Partition 22 Array Power Down</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 22 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 22 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM23</name>
              <description>RAM Partition 23 Array Power Down</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 23 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 23 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM24</name>
              <description>RAM Partition 24 Array Power Down</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 24 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 24 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM25</name>
              <description>RAM Partition 25 Array Power Down</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 25 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 25 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM26</name>
              <description>RAM Partition 26 Array Power Down</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 26 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 26 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM27</name>
              <description>RAM Partition 27 Array Power Down</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 27 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 27 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM28</name>
              <description>RAM Partition 28 Array Power Down</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 28 array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 28 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM29</name>
              <description>RAM Partition 29 Array Power Down</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Powers on RAM Partition 29 array</description>
                  <value>0</value>
                </enumeratedValue>
