Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core1.xml
        <register>
          <name>LPM_CSR2</name>
          <description>USB LPM Control and Status 2</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPM_HST_SEND</name>
              <description>LPM Host Send Extension Token</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_HST_SEND0</name>
                  <description>LPM transaction did not happen or is complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_HST_SEND1</name>
                  <description>LPM transaction is ongoing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_HST_DEVADD</name>
              <description>LPM Host Extension Token's Device Address</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_HST_BESL</name>
              <description>LPM Host Extension Token's BESL or HIRD</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_HST_RWKEN</name>
              <description>LPM Host Extension Token's bRemoteWake</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_HST_RWKEN0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_HST_RWKEN1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_HST_STSRCVD</name>
              <description>LPM Host Response Status from the Device</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_HST_STSRCVD0</name>
                  <description>Invalid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_HST_STSRCVD1</name>
                  <description>ACK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_HST_STSRCVD2</name>
                  <description>NYET</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_HST_STSRCVD3</name>
                  <description>STALL</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_HST_STSRCVD4</name>
                  <description>Timeout</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_HST_STSRCVD5</name>
                  <description>ERR</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EUSB_CTRL0</name>
          <description>eUSB Control 0</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000094</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UN_TERMINATED_MODE</name>
              <description>HS Receiver Termination Option</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UN_TERMINATED_MODE0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UN_TERMINATED_MODE1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PONRST</name>
              <description>Power-On Reset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PONRST0</name>
                  <description>Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PONRST1</name>
                  <description>Operate normally</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NATIVE_MODE</name>
              <description>Mode Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NATIVE_MODE0</name>
                  <description>Repeater mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NATIVE_MODE1</name>
                  <description>Native mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EUSB_DEV_PORT_RST</name>
              <description>Trigger Device Issue Port Reset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EUSB_DEV_PORT_RST0</name>
                  <description>No action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EUSB_DEV_PORT_RST1</name>
                  <description>Trigger device issue port reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EUSB_CTRL1</name>
          <description>eUSB Control 1</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EUSB_SQ</name>
              <description>eUSB Squelch</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EUSB_SQ000</name>
                  <description>66.6mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EUSB_SQ001</name>
                  <description>63.2mV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EUSB_SQ010</name>
                  <description>59.7mV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EUSB_SQ011</name>
                  <description>56mV</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EUSB_SQ100</name>
                  <description>80.6mV</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EUSB_SQ101</name>
                  <description>76.9mV</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EUSB_SQ110</name>
                  <description>73.5mV</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EUSB_SQ111</name>
                  <description>70mV</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EUSB_FSTX_OPT</name>
              <description>eUSB Full-Speed TX Option</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EUSB_FSTX_OPT00</name>
                  <description>Default</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EUSB_FSTX_OPT01</name>
                  <description>Faster 10%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EUSB_FSTX_OPT10</name>
                  <description>Slower 20%</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EUSB_FSTX_OPT11</name>
                  <description>Slower 10%</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EUSB_CTRL3</name>
          <description>eUSB Control 3</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XCfg_U2_SWING</name>
              <description>HSTX swing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XCfg_U2_SWING00</name>
                  <description>200mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCfg_U2_SWING01</name>
                  <description>195.9mV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCfg_U2_SWING02</name>
                  <description>191.7mV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCfg_U2_SWING03</name>
                  <description>187.5mV</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCfg_U2_SWING04</name>
                  <description>216.7mV</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCfg_U2_SWING05</name>
                  <description>212.5mV</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCfg_U2_SWING06</name>
                  <description>208.4mV</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCfg_U2_SWING07</name>
                  <description>204.2mV</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCfg_U2_SWING08</name>
                  <description>233.4mV</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCfg_U2_SWING09</name>
                  <description>229.2mV</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCfg_U2_SWING10</name>
                  <description>225mV</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCfg_U2_SWING11</name>
                  <description>220.9mV</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCfg_U2_SWING12</name>
                  <description>250mV</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCfg_U2_SWING13</name>
                  <description>245.9mV</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCfg_U2_SWING14</name>
                  <description>241.7mV</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCfg_U2_SWING15</name>
                  <description>237.5mV</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EUSB_RAP</name>
          <description>eUSB RAP Control and Status</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CM_RAP_WRDATA</name>
              <description>CM.RAP Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CM_RAP_ADDR</name>
              <description>CM.RAP Address</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CM_RAP_OP</name>
              <description>CM.RAP Operation Code</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_RAP_OP_00</name>
                  <description>Write; data is written to the register address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_RAP_OP_01</name>
                  <description>Read; data is read from the register address</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_RAP_OP_10</name>
                  <description>Clear; active-high, bitwise clear with the data on the register address</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_RAP_OP_11</name>
                  <description>Set; bitwise OR with the data on the register address</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM_RAP_INIT_EN</name>
              <description>Enable CM.RAP Feature</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_RAP_INIT_EN0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_RAP_INIT_EN1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM_RAP_START</name>
              <description>CM.RAP Start</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_RAP_START0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_RAP_START1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM_RAP_FAIL</name>
              <description>CM.RAP Command Fail</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_RAP_FAIL0</name>
                  <description>Not failed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_RAP_FAIL1</name>
                  <description>Failed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM_RAP_DONE</name>
              <description>CM.RAP Command Done</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_RAP_DONE0</name>
                  <description>Not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_RAP_DONE1</name>
                  <description>Complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM_RAP_INIT_READY</name>
              <description>Host and Device Entering CM.RAP State</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_RAP_INIT_READY0</name>
                  <description>Not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_RAP_INIT_READY1</name>
                  <description>Ready</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM_RAP_RDDATA</name>
              <description>CM.RAP Read Data</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
