Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC1</name>
      <description>Nested Vectored Interrupt Controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>Reserved16</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>Reserved17</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>Reserved18</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>FRO2</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>GLIKEY4</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>UTICK1</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>MRT1</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>CTIMER5</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>CTIMER6</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>CTIMER7</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>LPI2C15</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM17</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM18</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM19</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM20</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>ADC</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>SDADC</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>GLIKEY1</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>ACMP</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>PDM_EVENT</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>HYPERVISOR</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>SECURE_VIOLATION</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>PDM_HWVAD_EVENT</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>RTC1_ALARM</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>RTC1</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>HIFI1</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>MU1_B</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>MU3_A</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>PMC</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>OS_EVENT</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>USDHC0</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>USDHC1</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>I3C2</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>USB0</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>USB1</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>WDT2</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>WDT3</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>USBPHY0</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>Reserved55</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>I3C3</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>FLEXIO</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>LCDIF</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>VGPU</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>MIPI</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>EDMA2_CH0</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>EDMA2_CH1</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>EDMA2_CH2</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>EDMA2_CH3</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>EDMA2_CH4</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>EDMA2_CH5</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>EDMA2_CH6</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>EDMA2_CH7</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>EDMA3_CH0</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>EDMA3_CH1</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>EDMA3_CH2</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>EDMA3_CH3</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>EDMA3_CH4</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>EDMA3_CH5</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>EDMA3_CH6</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>EDMA3_CH7</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>GPIO80</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>GPIO81</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>GPIO90</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>GPIO91</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>GPIO100</name>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>GPIO101</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>Reserved83</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>Reserved84</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT0</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT1</name>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT2</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT3</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>SAI3</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>XSPI2</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>MMU2</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>GDET3</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>CDOG3</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>CDOG4</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>Reserved96</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>CPU1</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>JPEGDEC</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>PNGDEC</name>
        <value>83</value>
      </interrupt>
      <interrupt>
        <name>Reserved100</name>
        <value>84</value>
      </interrupt>
      <interrupt>
        <name>TEMPDET0</name>
        <value>85</value>
      </interrupt>
      <interrupt>
        <name>TEMPDET1</name>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>EZHV</name>
        <value>87</value>
      </interrupt>
      <interrupt>
        <name>SLEEPCON1</name>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>PVTS1_CPU1</name>
        <value>89</value>
      </interrupt>
      <interrupt>
        <name>Reserved106</name>
        <value>90</value>
      </interrupt>
      <interrupt>
        <name>PVTS1_HIFI1</name>
        <value>91</value>
      </interrupt>
      <interrupt>
        <name>Reserved108</name>
        <value>92</value>
      </interrupt>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ISER[%s]</name>
          <description>Interrupt Set Enable Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA0</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA1</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA2</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA3</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA4</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA5</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA6</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA7</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA8</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA9</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA10</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA11</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA12</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA13</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA14</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA15</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA16</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA17</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA18</name>
